import React from 'react';

export function LightningIcon({ className }: { className?: string }) {
  return (
    <svg 
      className={className} 
      viewBox="0 0 512 512"
      fill="none" 
      xmlns="http://www.w3.org/2000/svg"
    >
      {/* ⚠️ Заміни path на свій з файлу, якщо він відрізняється, 
          і ОБОВ'ЯЗКОВО напиши fill="currentColor" */}
      <path 
        d="M163.022 608.814C167.111 610.961 171.533 612 175.913 612C183.9 612 191.75 608.55 197.172 602.099L493.469 249.736C500.428 241.459 501.965 229.894 497.408 220.084C492.85 210.273 483.026 203.999 472.222 203.999H319.12L421.584 42.7527C427.026 34.1866 427.376 23.332 422.498 14.432C417.621 5.53024 408.287 0 398.148 0H231.481C221.569 0 212.407 5.28915 207.443 13.8794L3.73867 366.242C-1.23726 374.849 -1.24652 385.459 3.71275 394.075C8.67386 402.691 17.8479 407.999 27.7776 407.999H195.113L149.126 576.86C145.696 589.458 151.476 602.751 163.022 608.814Z" 
        fill="currentColor" 
      />
    </svg>
  );
}